tiborsimon/embedded-tdd-headers/pic/8bit/pic18f25k80_tdd.h
#define RXF12EIDH_EID10               522
#define RXF12EID11                    523
#define RXF12EIDH_EID11               524
#define RXF12EID12                    525
#define RXF12EIDH_EID12               526
#define RXF12EID13                    527
#define RXF12EIDH_EID13               528
#define RXF12EID14                    529
#define RXF12EIDH_EID14               530
#define RXF12EID15                    531
#define RXF12EIDH_EID15               532
#define RXF12EIDL                     533
#define RXF12EIDL_EID0                534
#define RXF12EID0                     535
#define RXF12EIDL_EID                 536
#define RXF12EIDL_EID1                537
#define RXF12EID1                     538
#define RXF12EIDL_EID2                539
#define RXF12EID2                     540
#define RXF12EIDL_EID3                541
#define RXF12EID3                     542
#define RXF12EIDL_EID4                543
#define RXF12EID4                     544
#define RXF12EIDL_EID5                545
#define RXF12EID5                     546
#define RXF12EIDL_EID6                547
#define RXF12EID6                     548
#define RXF12EIDL_EID7                549
#define RXF12EID7                     550
#define RXF13SIDH                     551
#define RXF13SIDH_SID                 552
#define RXF13SID3                     553
#define RXF13SIDH_SID3                554
#define RXF13SID4                     555
#define RXF13SIDH_SID4                556
#define RXF13SID5                     557
#define RXF13SIDH_SID5                558
#define RXF13SID6                     559
#define RXF13SIDH_SID6                560
#define RXF13SID7                     561
#define RXF13SIDH_SID7                562
#define RXF13SID8                     563
#define RXF13SIDH_SID8                564
#define RXF13SID9                     565
#define RXF13SIDH_SID9                566
#define RXF13SIDH_SID10               567
#define RXF13SID10                    568
#define RXF13SIDL                     569
#define RXF13EID16                    570
#define RXF13SIDL_EID                 571
#define RXF13SIDL_EID16               572
#define RXF13EID17                    573
#define RXF13SIDL_EID17               574
#define RXF13EXIDEN                   575
#define RXF13SIDL_EXIDEN              576
#define RXF13SIDL_SID                 577
#define RXF13SIDL_SID0                578
#define RXF13SID0                     579
#define RXF13SIDL_SID1                580
#define RXF13SID1                     581
#define RXF13SIDL_SID2                582
#define RXF13SID2                     583
#define RXF13EIDH                     584
#define RXF13EIDH_EID8                585
#define RXF13EID8                     586
#define RXF13EIDH_EID                 587
#define RXF13EIDH_EID9                588
#define RXF13EID9                     589
#define RXF13EIDH_EID10               590
#define RXF13EID10                    591
#define RXF13EIDH_EID11               592
#define RXF13EID11                    593
#define RXF13EID12                    594
#define RXF13EIDH_EID12               595
#define RXF13EID13                    596
#define RXF13EIDH_EID13               597
#define RXF13EID14                    598
#define RXF13EIDH_EID14               599
#define RXF13EID15                    600
#define RXF13EIDH_EID15               601
#define RXF13EIDL                     602
#define RXF13EIDL_EID                 603
#define RXF13EID0                     604
#define RXF13EIDL_EID0                605
#define RXF13EID1                     606
#define RXF13EIDL_EID1                607
#define RXF13EID2                     608
#define RXF13EIDL_EID2                609
#define RXF13EID3                     610
#define RXF13EIDL_EID3                611
#define RXF13EID4                     612
#define RXF13EIDL_EID4                613
#define RXF13EID5                     614
#define RXF13EIDL_EID5                615
#define RXF13EID6                     616
#define RXF13EIDL_EID6                617
#define RXF13EID7                     618
#define RXF13EIDL_EID7                619
#define RXF14SIDH                     620
#define RXF14SIDH_SID                 621
#define RXF14SID3                     622
#define RXF14SIDH_SID3                623
#define RXF14SID4                     624
#define RXF14SIDH_SID4                625
#define RXF14SID5                     626
#define RXF14SIDH_SID5                627
#define RXF14SID6                     628
#define RXF14SIDH_SID6                629
#define RXF14SID7                     630
#define RXF14SIDH_SID7                631
#define RXF14SID8                     632
#define RXF14SIDH_SID8                633
#define RXF14SID9                     634
#define RXF14SIDH_SID9                635
#define RXF14SIDH_SID10               636
#define RXF14SID10                    637
#define RXF14SIDL                     638
#define RXF14SIDL_EID                 639
#define RXF14SIDL_EID16               640
#define RXF14EID16                    641
#define RXF14SIDL_EID17               642
#define RXF14EID17                    643
#define RXF14SIDL_EXIDEN              644
#define RXF14EXIDEN                   645
#define RXF14SIDL_SID                 646
#define RXF14SID0                     647
#define RXF14SIDL_SID0                648
#define RXF14SID1                     649
#define RXF14SIDL_SID1                650
#define RXF14SID2                     651
#define RXF14SIDL_SID2                652
#define RXF14EIDH                     653
#define RXF14EID8                     654
#define RXF14EIDH_EID8                655
#define RXF14EIDH_EID                 656
#define RXF14EID9                     657
#define RXF14EIDH_EID9                658
#define RXF14EID10                    659
#define RXF14EIDH_EID10               660
#define RXF14EID11                    661
#define RXF14EIDH_EID11               662
#define RXF14EID12                    663
#define RXF14EIDH_EID12               664
#define RXF14EID13                    665
#define RXF14EIDH_EID13               666
#define RXF14EID14                    667
#define RXF14EIDH_EID14               668
#define RXF14EID15                    669
#define RXF14EIDH_EID15               670
#define RXF14EIDL                     671
#define RXF14EID0                     672
#define RXF14EIDL_EID                 673
#define RXF14EIDL_EID0                674
#define RXF14EID1                     675
#define RXF14EIDL_EID1                676
#define RXF14EID2                     677
#define RXF14EIDL_EID2                678
#define RXF14EID3                     679
#define RXF14EIDL_EID3                680
#define RXF14EID4                     681
#define RXF14EIDL_EID4                682
#define RXF14EID5                     683
#define RXF14EIDL_EID5                684
#define RXF14EID6                     685
#define RXF14EIDL_EID6                686
#define RXF14EID7                     687
#define RXF14EIDL_EID7                688
#define RXF15SIDH                     689
#define RXF15SID3                     690
#define RXF15SIDH_SID3                691
#define RXF15SIDH_SID                 692
#define RXF15SID4                     693
#define RXF15SIDH_SID4                694
#define RXF15SID5                     695
#define RXF15SIDH_SID5                696
#define RXF15SID6                     697
#define RXF15SIDH_SID6                698
#define RXF15SID7                     699
#define RXF15SIDH_SID7                700
#define RXF15SID8                     701
#define RXF15SIDH_SID8                702
#define RXF15SID9                     703
#define RXF15SIDH_SID9                704
#define RXF15SID10                    705
#define RXF15SIDH_SID10               706
#define RXF15SIDL                     707
#define RXF15EID16                    708
#define RXF15SIDL_EID                 709
#define RXF15SIDL_EID16               710
#define RXF15EID17                    711
#define RXF15SIDL_EID17               712
#define RXF15SIDL_EXIDEN              713
#define RXF15EXIDEN                   714
#define RXF15SIDL_SID0                715
#define RXF15SID0                     716
#define RXF15SIDL_SID                 717
#define RXF15SIDL_SID1                718
#define RXF15SID1                     719
#define RXF15SIDL_SID2                720
#define RXF15SID2                     721
#define RXF15EIDH                     722
#define RXF15EID8                     723
#define RXF15EIDH_EID8                724
#define RXFEID                        725
#define RXF15EID9                     726
#define RXF15EIDH_EID9                727
#define RXF15EID10                    728
#define RXF15EIDH_EID10               729
#define RXF15EID11                    730
#define RXF15EIDH_EID11               731
#define RXF15EID12                    732
#define RXF15EIDH_EID12               733
#define RXF15EID13                    734
#define RXF15EIDH_EID13               735
#define RXF15EID14                    736
#define RXF15EIDH_EID14               737
#define RXF15EID15                    738
#define RXF15EIDH_EID15               739
#define RXF15EIDL                     740
#define RXF15EIDL_EID                 741
#define RXF15EIDL_EID0                742
#define RXF15EID0                     743
#define RXF15EIDL_EID1                744
#define RXF15EID1                     745
#define RXF15EIDL_EID2                746
#define RXF15EID2                     747
#define RXF15EIDL_EID3                748
#define RXF15EID3                     749
#define RXF15EIDL_EID4                750
#define RXF15EID4                     751
#define RXF15EIDL_EID5                752
#define RXF15EID5                     753
#define RXF15EID6                     754
#define RXF15EIDL_EID6                755
#define RXF15EIDL_EID7                756
#define RXF15EID7                     757
#define SDFLC                         758
#define FLC                           759
#define FLC0                          760
#define FLC1                          761
#define FLC2                          762
#define FLC3                          763
#define FLC4                          764
#define RXFBCON0                      765
#define F0BP_01                       766
#define F0BP_0                        767
#define F0BP                          768
#define F0BP_1                        769
#define F0BP_2                        770
#define F0BP_3                        771
#define F1BP_0                        772
#define F1BP                          773
#define F1BP_1                        774
#define F1BP_2                        775
#define F1BP_3                        776
#define RXFBCON1                      777
#define F2BP_0                        778
#define F2BP                          779
#define F2BP_01                       780
#define F2BP_1                        781
#define F2BP_2                        782
#define F2BP_3                        783
#define F3BP_0                        784
#define F3BP                          785
#define F3BP_1                        786
#define F3BP_2                        787
#define F3BP_3                        788
#define RXFBCON2                      789
#define F4BP                          790
#define F4BP_01                       791
#define F4BP_0                        792
#define F4BP_1                        793
#define F4BP_2                        794
#define F4BP_3                        795
#define F5BP                          796
#define F5BP_0                        797
#define F5BP_1                        798
#define F5BP_2                        799
#define F5BP_3                        800
#define RXFBCON3                      801
#define F6BP_0                        802
#define F6BP                          803
#define F6BP_01                       804
#define F6BP_1                        805
#define F6BP_2                        806
#define F6BP_3                        807
#define F7BP                          808
#define F7BP_0                        809
#define F7BP_1                        810
#define F7BP_2                        811
#define F7BP_3                        812
#define RXFBCON4                      813
#define F8BP                          814
#define F8BP_0                        815
#define F8BP_01                       816
#define F8BP_1                        817
#define F8BP_2                        818
#define F8BP_3                        819
#define F9BP_0                        820
#define F9BP                          821
#define F9BP_1                        822
#define F9BP_2                        823
#define F9BP_3                        824
#define RXFBCON5                      825
#define F10BP_01                      826
#define F10BP_0                       827
#define F10BP                         828
#define F10BP_1                       829
#define F10BP_2                       830
#define F10BP_3                       831
#define F11BP_0                       832
#define F11BP                         833
#define F11BP_1                       834
#define F11BP_2                       835
#define F11BP_3                       836
#define RXFBCON6                      837
#define F12BP                         838
#define F12BP_01                      839
#define F12BP_0                       840
#define F12BP_1                       841
#define F12BP_2                       842
#define F12BP_3                       843
#define F13BP                         844
#define F13BP_0                       845
#define F13BP_1                       846
#define F13BP_2                       847
#define F13BP_3                       848
#define RXFBCON7                      849
#define F14BP_0                       850
#define F14BP                         851
#define F14BP_01                      852
#define F14BP_1                       853
#define F14BP_2                       854
#define F14BP_3                       855
#define F15BP_0                       856
#define F15BP                         857
#define F15BP_1                       858
#define F15BP_2                       859
#define F15BP_3                       860
#define MSEL0                         861
#define FIL0                          862
#define FIL0_0                        863
#define FIL0_1                        864
#define FIL1                          865
#define FIL1_0                        866
#define FIL1_1                        867
#define FIL2                          868
#define FIL2_0                        869
#define FIL2_1                        870
#define FIL3                          871
#define FIL3_0                        872
#define FIL3_1                        873
#define MSEL1                         874
#define FIL4                          875
#define FIL4_0                        876
#define FIL4_1                        877
#define FIL5                          878
#define FIL5_0                        879
#define FIL5_1                        880
#define FIL6_0                        881
#define FIL6                          882
#define FIL6_1                        883
#define FIL7                          884
#define FIL7_0                        885
#define FIL7_1                        886
#define MSEL2                         887
#define FIL8_0                        888
#define FIL8                          889
#define FIL8_1                        890
#define FIL9_0                        891
#define FIL9                          892
#define FIL9_1                        893
#define FIL10                         894
#define FIL10_0                       895
#define FIL10_1                       896
#define FIL11                         897
#define FIL11_0                       898
#define FIL11_1                       899
#define MSEL3                         900
#define FIL12                         901
#define FIL12_0                       902
#define FIL12_1                       903
#define FIL13                         904
#define FIL13_0                       905
#define FIL13_1                       906
#define FIL14                         907
#define FIL14_0                       908
#define FIL14_1                       909
#define FIL15                         910
#define FIL15_0                       911
#define FIL15_1                       912
#define BSEL0                         913
#define B0TXEN                        914
#define B1TXEN                        915
#define B2TXEN                        916
#define B3TXEN                        917
#define B4TXEN                        918
#define B5TXEN                        919
#define BIE0                          920
#define BIE0_RXB0IE                   921
#define DRXB0IE                       922
#define BIE0_RXB1IE                   923
#define DRXB1IE                       924
#define B0IE                          925
#define B1IE                          926
#define B2IE                          927
#define B3IE                          928
#define B4IE                          929
#define B5IE                          930
#define TXBIE                         931
#define TX0IE                         932
#define TXBIE_TXB0IE                  933
#define TXBIE_TXB1IE                  934
#define TXBIE_TX1IE                   935
#define TXBIE_TX2IE                   936
#define TXBIE_TXB2IE                  937
#define B0CON                         938
#define B0CON_TXPRI0                  939
#define B0FILHIT0                     940
#define B0CON_FILHIT0_TXPRI0          941
#define B0CON_FILHIT0                 942
#define B0TXPRI0                      943
#define B0FILHIT1                     944
#define B0CON_TXPRI1                  945
#define B0TXPRI1                      946
#define B0CON_FILHIT1                 947
#define B0CON_FILHIT1_TXPRI1          948
#define B0FILHIT2                     949
#define B0CON_RTREN                   950
#define B0CON_FILHIT2_RTREN           951
#define B0CON_FILHIT2                 952
#define B0RTREN                       953
#define B0FILHIT3                     954
#define B0CON_TXREQ                   955
#define B0TXREQ                       956
#define B0CON_FILHIT3                 957
#define B0CON_FILHIT3_TXREQ           958
#define B0FILHIT4                     959
#define B0CON_TXERR                   960
#define B0CON_FILHIT4                 961
#define B0TXERR                       962
#define B0CON_FILHIT4_TXERR           963
#define B0CON_RXRTRRO                 964
#define B0TXLARB                      965
#define B0RTRRO                       966
#define B0CON_RXRTRRO_TXLARB          967
#define B0CON_TXLARB                  968
#define B0CON_RXM1_TXABT              969
#define B0CON_TXABT                   970
#define B0RXM1                        971
#define B0TXABT                       972
#define B0CON_RXM1                    973
#define B0CON_RXFUL                   974
#define B0CON_RXFUL_TXBIF             975
#define B0RXFUL                       976
#define B0CON_TXBIF                   977
#define B0TXB3IF                      978
#define B0SIDH                        979
#define B0SIDH_SID3                   980
#define B0SID3                        981
#define B0SIDH_SID                    982
#define B0SIDH_SID4                   983
#define B0SID4                        984
#define B0SIDH_SID5                   985
#define B0SID5                        986
#define B0SIDH_SID6                   987
#define B0SID6                        988
#define B0SIDH_SID7                   989
#define B0SID7                        990
#define B0SIDH_SID8                   991
#define B0SID8                        992
#define B0SIDH_SID9                   993
#define B0SID9                        994
#define B0SIDH_SID10                  995
#define B0SID10                       996
#define B0SIDL                        997
#define B0SIDL_EID                    998
#define B0SIDL_EID16                  999
#define B0EID16                       1000
#define B0EID17                       1001
#define B0SIDL_EID17                  1002
#define B0SIDL_EXIDE                  1003
#define B0EXID                        1004
#define B0SRR                         1005
#define B0SIDL_SRR                    1006
#define B0SID0                        1007
#define B0SIDL_SID                    1008
#define B0SIDL_SID0                   1009
#define B0SID1                        1010
#define B0SIDL_SID1                   1011
#define B0SID2                        1012
#define B0SIDL_SID2                   1013
#define B0EIDH                        1014
#define B0EID8                        1015
#define B0EIDH_EID                    1016
#define B0EIDH_EID8                   1017
#define B0EID9                        1018
#define B0EIDH_EID9                   1019
#define B0EID10                       1020
#define B0EIDH_EID10                  1021
#define B0EID11                       1022
#define B0EIDH_EID11                  1023
#define B0EID12                       1024
#define B0EIDH_EID12                  1025
#define B0EID13                       1026
#define B0EIDH_EID13                  1027
#define B0EID14                       1028
#define B0EIDH_EID14                  1029
#define B0EID15                       1030
#define B0EIDH_EID15                  1031
#define B0EIDL                        1032
#define B0EID0                        1033
#define B0EIDL_EID                    1034
#define B0EIDL_EID0                   1035
#define B0EID1                        1036
#define B0EIDL_EID1                   1037
#define B0EID2                        1038
#define B0EIDL_EID2                   1039
#define B0EID3                        1040
#define B0EIDL_EID3                   1041
#define B0EID4                        1042
#define B0EIDL_EID4                   1043
#define B0EID5                        1044
#define B0EIDL_EID5                   1045
#define B0EID6                        1046
#define B0EIDL_EID6                   1047
#define B0EID7                        1048
#define B0EIDL_EID7                   1049
#define B0DLC                         1050
#define B0DLC_DLC0                    1051
#define B0DLC0                        1052
#define B0DLC_DLC                     1053
#define B0DLC_DLC1                    1054
#define B0DLC1                        1055
#define B0DLC_DLC2                    1056
#define B0DLC2                        1057
#define B0DLC_DLC3                    1058
#define B0DLC3                        1059
#define B0DLC_RB0                     1060
#define B0RB0                         1061
#define B0DLC_RB                      1062
#define B0DLC_RB1                     1063
#define B0RB1                         1064
#define B0DLC_RXRTR_TXRTR             1065
#define B0RXRTR                       1066
#define B0DLC_RXRTR                   1067
#define B0DLC_TXRTR                   1068
#define B0D0                          1069
#define B0D00                         1070
#define B0D01                         1071
#define B0D02                         1072
#define B0D03                         1073
#define B0D04                         1074
#define B0D05                         1075
#define B0D06                         1076
#define B0D07                         1077
#define B0D1                          1078
#define B0D10                         1079
#define B0D11                         1080
#define B0D12                         1081
#define B0D13                         1082
#define B0D14                         1083
#define B0D15                         1084
#define B0D16                         1085
#define B0D17                         1086
#define B0D2                          1087
#define B0D20                         1088
#define B0D21                         1089
#define B0D22                         1090
