tiborsimon/embedded-tdd-headers/pic/8bit/pic18f25k80_tdd.h
#define RCSTA2_ADDEN                  4439
#define RCSTA2_CREN                   4440
#define CREN2                         4441
#define SREN2                         4442
#define RCSTA2_SREN                   4443
#define RC92                          4444
#define RC8_92                        4445
#define RCSTA2_RX9                    4446
#define RX92                          4447
#define RCSTA2_SPEN                   4448
#define SPEN2                         4449
#define BAUDCON1                      4450
#define BAUDCON1_ABDEN                4451
#define ABDEN1                        4452
#define BAUDCON1_WUE                  4453
#define WUE1                          4454
#define BRG161                        4455
#define BAUDCON1_BRG16                4456
#define CKTXP                         4457
#define BAUDCON1_TXCKP                4458
#define SCKP1                         4459
#define TXCKP1                        4460
#define SCKP                          4461
#define DTRXP1                        4462
#define RXDTP1                        4463
#define DTRXP                         4464
#define BAUDCON1_RXDTP                4465
#define BAUDCON1_RCMT                 4466
#define RCMT1                         4467
#define RCIDL1                        4468
#define BAUDCON1_RCIDL                4469
#define ABDOVF1                       4470
#define BAUDCON1_ABDOVF               4471
#define HLVDCON                       4472
#define HLVDL                         4473
#define HLVDL0                        4474
#define HLVDL1                        4475
#define HLVDL2                        4476
#define HLVDL3                        4477
#define HLVDEN                        4478
#define IRVST                         4479
#define BGVST                         4480
#define VDIRMAG                       4481
#define PR4                           4482
#define T1GCON                        4483
#define T1GSS0                        4484
#define T1GSS                         4485
#define T1GSS1                        4486
#define T1GVAL                        4487
#define T1GGO_nT1DONE                 4488
#define nT1DONE                       4489
#define T1GGO_NOT_T1DONE              4490
#define NOT_T1DONE                    4491
#define T1GGO                         4492
#define T1GSPM                        4493
#define T1GTM                         4494
#define T1GPOL                        4495
#define TMR1GE                        4496
#define RCSTA1                        4497
#define RCSTA1_RX9D                   4498
#define RX9D1                         4499
#define RCD8                          4500
#define RCSTA1_OERR                   4501
#define OERR1                         4502
#define RCSTA1_FERR                   4503
#define FERR1                         4504
#define RCSTA1_ADDEN                  4505
#define ADDEN1                        4506
#define ADEN                          4507
#define RCSTA1_CREN                   4508
#define CREN1                         4509
#define SRENA                         4510
#define SREN1                         4511
#define RCSTA1_SREN                   4512
#define RC8_9                         4513
#define RCSTA1_RX9                    4514
#define nRC8                          4515
#define NOT_RC8                       4516
#define RC9                           4517
#define RX91                          4518
#define RCSTA1_SPEN                   4519
#define SPEN1                         4520
#define TXSTA1                        4521
#define TX9D1                         4522
#define TXSTA1_TX9D                   4523
#define TXD8                          4524
#define TRMT1                         4525
#define TXSTA1_TRMT                   4526
#define BRGH1                         4527
#define TXSTA1_BRGH                   4528
#define TXSTA1_SENDB                  4529
#define SENDB1                        4530
#define TXSTA1_SYNC                   4531
#define SYNC1                         4532
#define TXEN1                         4533
#define TXSTA1_TXEN                   4534
#define TX91                          4535
#define TX8_9                         4536
#define NOT_TX8                       4537
#define nTX8                          4538
#define TXSTA1_TX9                    4539
#define TXSTA1_CSRC                   4540
#define CSRC1                         4541
#define TXREG1                        4542
#define RCREG1                        4543
#define SPBRG1                        4544
#define T3GCON                        4545
#define T3GSS0                        4546
#define T3GSS                         4547
#define T3GSS1                        4548
#define T3GVAL                        4549
#define T3GGO                         4550
#define NOT_T3DONE                    4551
#define nT3DONE                       4552
#define T3GGO_nT3DONE                 4553
#define T3GGO_NOT_T3DONE              4554
#define T3GSPM                        4555
#define T3GTM                         4556
#define T3GPOL                        4557
#define TMR3GE                        4558
#define T3CON                         4559
#define TMR3ON                        4560
#define T3CON_RD16                    4561
#define nT3SYNC                       4562
#define NOT_T3SYNC                    4563
#define SOSCEN3                       4564
#define T3CON_SOSCEN                  4565
#define T3CKPS0                       4566
#define T3CKPS                        4567
#define T3CKPS1                       4568
#define TMR3CS0                       4569
#define TMR3CS                        4570
#define TMR3CS1                       4571
#define T3RD16                        4572
#define RD163                         4573
#define TMR3L                         4574
#define TMR3H                         4575
#define CMSTAT                        4576
#define C2OUT                         4577
#define CMP1OUT                       4578
#define C3OUT                         4579
#define CMP2OUT                       4580
#define CVRCON                        4581
#define CVR                           4582
#define CVR0                          4583
#define CVR1                          4584
#define CVR2                          4585
#define CVR3                          4586
#define CVR4                          4587
#define CVRR                          4588
#define CVRSS                         4589
#define CVROEN                        4590
#define CVROE                         4591
#define CVREN                         4592
#define PIE4                          4593
#define CCP3IE                        4594
#define CCP4IE                        4595
#define CCP5IE                        4596
#define CMP1IE                        4597
#define CMP2IE                        4598
#define EEIE                          4599
#define TMR4IE                        4600
#define PIR4                          4601
#define CCP3IF                        4602
#define CCP4IF                        4603
#define CCP5IF                        4604
#define CMP1IF                        4605
#define CMP2IF                        4606
#define EEIF                          4607
#define TMR4IF                        4608
#define IPR4                          4609
#define CCIP3IP                       4610
#define CCP3IP                        4611
#define CCP4IP                        4612
#define CCP5IP                        4613
#define CMP1IP                        4614
#define CMP2IP                        4615
#define EEIP                          4616
#define TMR4IP                        4617
#define BAUDCON2                      4618
#define ABDEN2                        4619
#define BAUDCON2_ABDEN                4620
#define WUE2                          4621
#define BAUDCON2_WUE                  4622
#define BRG162                        4623
#define BAUDCON2_BRG16                4624
#define SCKP2                         4625
#define TXCKP2                        4626
#define BAUDCON2_TXCKP                4627
#define DTRXP2                        4628
#define RXDTP2                        4629
#define BAUDCON2_RXDTP                4630
#define RCMT2                         4631
#define RCIDL2                        4632
#define BAUDCON2_RCIDL                4633
#define BAUDCON2_RCMT                 4634
#define BAUDCON2_ABDOVF               4635
#define ABDOVF2                       4636
#define TXSTA2                        4637
#define TX9D2                         4638
#define TXSTA2_TX9D                   4639
#define TXD82                         4640
#define TRMT2                         4641
#define TXSTA2_TRMT                   4642
#define BRGH2                         4643
#define TXSTA2_BRGH                   4644
#define SENDB2                        4645
#define TXSTA2_SENDB                  4646
#define TXSTA2_SYNC                   4647
#define SYNC2                         4648
#define TXEN2                         4649
#define TXSTA2_TXEN                   4650
#define TX8_92                        4651
#define TX92                          4652
#define TXSTA2_TX9                    4653
#define TXSTA2_CSRC                   4654
#define CSRC2                         4655
#define CCP1CON                       4656
#define CCP1M0                        4657
#define CCP1M                         4658
#define CCP1M1                        4659
#define CCP1M2                        4660
#define CCP1M3                        4661
#define CCP1Y                         4662
#define DC1B                          4663
#define DC1B0                         4664
#define CCP1X                         4665
#define DC1B1                         4666
#define P1M                           4667
#define P1M0                          4668
#define P1M1                          4669
#define CCPR1L                        4670
#define CCPR1H                        4671
#define ECCP1DEL                      4672
#define P1DC                          4673
#define P1DC0                         4674
#define P1DC1                         4675
#define P1DC2                         4676
#define P1DC3                         4677
#define P1DC4                         4678
#define P1DC5                         4679
#define P1DC6                         4680
#define P1RSEN                        4681
#define PSS1BD0                       4682
#define PSS1BD                        4683
#define PSS1BD1                       4684
#define PSS1AC                        4685
#define PSS1AC0                       4686
#define PSS1AC1                       4687
#define ECCP1AS                       4688
#define ECCP1AS0                      4689
#define ECCP1AS1                      4690
#define ECCP1AS2                      4691
#define ECCP1ASE                      4692
#define ADCON2                        4693
#define ADCS0                         4694
#define ADCS                          4695
#define ADCS1                         4696
#define ADCS2                         4697
#define ACQT0                         4698
#define ACQT                          4699
#define ACQT1                         4700
#define ACQT2                         4701
#define ADFM                          4702
#define ADCON1                        4703
#define CHSN0                         4704
#define CHSN                          4705
#define CHSN1                         4706
#define CHSN2                         4707
#define VNCFG                         4708
#define CHSN3                         4709
#define VCFG                          4710
#define VCFG01                        4711
#define VCFG0                         4712
#define VCFG11                        4713
#define VCFG1                         4714
#define TRIGSEL                       4715
#define TRIGSEL0                      4716
#define TRIGSEL1                      4717
#define ADCON0                        4718
#define ADON                          4719
#define nDONE                         4720
#define GO_nDONE                      4721
#define NOT_DONE                      4722
#define GODONE                        4723
#define GO_DONE                       4724
#define DONE                          4725
#define GO_NOT_DONE                   4726
#define GO                            4727
#define CHS0                          4728
#define CHS                           4729
#define CHS1                          4730
#define CHS2                          4731
#define CHS3                          4732
#define CHS4                          4733
#define ADRESL                        4734
#define ADRESH                        4735
#define SSPCON2                       4736
#define SEN                           4737
#define RSEN                          4738
#define ADMSK1                        4739
#define PEN                           4740
#define ADMSK2                        4741
#define RCEN                          4742
#define ADMSK3                        4743
#define ACKEN                         4744
#define ADMSK4                        4745
#define ADMSK5                        4746
#define ACKDT                         4747
#define ACKSTAT                       4748
#define GCEN                          4749
#define SSPCON1                       4750
#define SSPM0                         4751
#define SSPM                          4752
#define SSPM1                         4753
#define SSPM2                         4754
#define SSPM3                         4755
#define CKP                           4756
#define SSPEN                         4757
#define SSPOV                         4758
#define WCOL                          4759
#define SSPSTAT                       4760
#define BF                            4761
#define UA                            4762
#define R_NOT_W                       4763
#define READ_WRITE                    4764
#define NOT_W                         4765
#define R_W                           4766
#define nW                            4767
#define RW                            4768
#define nWRITE                        4769
#define NOT_WRITE                     4770
#define R_nW                          4771
#define I2C_READ                      4772
#define START                         4773
#define S                             4774
#define I2C_START                     4775
#define STOP                          4776
#define I2C_STOP                      4777
#define P                             4778
#define NOT_A                         4779
#define DATA_ADDRESS                  4780
#define nA                            4781
#define D_A                           4782
#define D_nA                          4783
#define DA                            4784
#define D_NOT_A                       4785
#define NOT_ADDRESS                   4786
#define nADDRESS                      4787
#define I2C_DAT                       4788
#define CKE                           4789
#define SMP                           4790
#define SSPADD                        4791
#define MSK0                          4792
#define MSK1                          4793
#define MSK2                          4794
#define MSK3                          4795
#define MSK4                          4796
#define MSK5                          4797
#define MSK6                          4798
#define MSK7                          4799
#define SSPBUF                        4800
#define T2CON                         4801
#define T2CKPS0                       4802
#define T2CKPS                        4803
#define T2CKPS1                       4804
#define TMR2ON                        4805
#define T2OUTPS0                      4806
#define T2OUTPS                       4807
#define T2OUTPS1                      4808
#define T2OUTPS2                      4809
#define T2OUTPS3                      4810
#define WM0                           4811
#define PR2                           4812
#define WM1                           4813
#define WAIT0                         4814
#define WAIT1                         4815
#define EBDIS                         4816
#define TMR2                          4817
#define T1CON                         4818
#define TMR1ON                        4819
#define T1CON_RD16                    4820
#define NOT_T1SYNC                    4821
#define nT1SYNC                       4822
#define T1OSCEN                       4823
#define T1CON_SOSCEN                  4824
#define T1CKPS0                       4825
#define T1CKPS                        4826
#define T1CKPS1                       4827
#define TMR1CS0                       4828
#define TMR1CS                        4829
#define T1RD16                        4830
#define TMR1CS1                       4831
#define TMR1L                         4832
#define TMR1H                         4833
#define RCON                          4834
#define BOR                           4835
#define NOT_BOR                       4836
#define nBOR                          4837
#define POR                           4838
#define nPOR                          4839
#define NOT_POR                       4840
#define PD                            4841
#define nPD                           4842
#define NOT_PD                        4843
#define nTO                           4844
#define TO                            4845
#define NOT_TO                        4846
#define nRI                           4847
#define NOT_RI                        4848
#define RI                            4849
#define NOT_CM                        4850
#define CM                            4851
#define nCM                           4852
#define SBOREN                        4853
#define IPEN                          4854
#define WDTCON                        4855
#define SWDTEN                        4856
#define SWDTE                         4857
#define ULPSINK                       4858
#define ULPEN                         4859
#define SRETEN                        4860
#define ULPLVL                        4861
#define REGSLP                        4862
#define OSCCON2                       4863
#define LVDL0                         4864
#define MFIOSEL                       4865
#define MFIOFS                        4866
#define LVDL1                         4867
#define LVDL2                         4868
#define SOSCGO                        4869
#define LVDL3                         4870
#define SOSCDRV                       4871
#define SOSCRUN                       4872
#define OSCCON                        4873
#define SCS0                          4874
#define SCS                           4875
#define SCS1                          4876
#define HFIOFS                        4877
#define OSTS                          4878
#define IRCF                          4879
#define IRCF0                         4880
#define IRCF1                         4881
#define IRCF2                         4882
#define IDLEN                         4883
#define T0CON                         4884
#define T0PS                          4885
#define T0PS0                         4886
#define T0PS1                         4887
#define T0PS2                         4888
#define PSA                           4889
#define T0SE                          4890
#define T0CS                          4891
#define T08BIT                        4892
#define TMR0ON                        4893
#define TMR0L                         4894
#define TMR0H                         4895
#define STATUS                        4896
#define C                             4897
#define CARRY                         4898
#define DC                            4899
#define ZERO                          4900
#define Z                             4901
#define OV                            4902
#define OVERFLOW                      4903
#define N                             4904
#define NEGATIVE                      4905
#define FSR2L                         4906
#define FSR2H                         4907
#define PLUSW2                        4908
#define PREINC2                       4909
#define POSTDEC2                      4910
#define POSTINC2                      4911
#define INDF2                         4912
#define BSR                           4913
#define FSR1L                         4914
#define FSR1H                         4915
#define PLUSW1                        4916
#define PREINC1                       4917
#define POSTDEC1                      4918
#define POSTINC1                      4919
#define INDF1                         4920
#define WREG                          4921
#define FSR0L                         4922
#define FSR0H                         4923
#define PLUSW0                        4924
#define PREINC0                       4925
#define POSTDEC0                      4926
#define POSTINC0                      4927
#define INDF0                         4928
#define INTCON3                       4929
#define INT1IF                        4930
#define INT1F                         4931
#define INT2IF                        4932
#define INT2F                         4933
#define INT3F                         4934
#define INT3IF                        4935
#define INT1E                         4936
#define INT1IE                        4937
#define INT2IE                        4938
#define INT2E                         4939
#define INT3E                         4940
#define INT3IE                        4941
#define INT1P                         4942
#define INT1IP                        4943
#define INT2IP                        4944
#define INT2P                         4945
#define INTCON2                       4946
#define RBIP                          4947
#define INT3IP                        4948
#define INT3P                         4949
#define TMR0IP                        4950
#define T0IP                          4951
#define INTEDG3                       4952
#define INTEDG2                       4953
#define INTEDG1                       4954
#define INTEDG0                       4955
#define RBPU                          4956
#define NOT_RBPU                      4957
#define nRBPU                         4958
#define INTCON                        4959
#define RBIF                          4960
#define INT0F                         4961
#define INT0IF                        4962
#define T0IF                          4963
#define TMR0IF                        4964
#define RBIE                          4965
#define INT0E                         4966
#define INT0IE                        4967
#define T0IE                          4968
#define TMR0IE                        4969
#define PEIE                          4970
#define PEIE_GIEL                     4971
#define GIEL                          4972
#define GIE_GIEH                      4973
#define GIE                           4974
#define GIEH                          4975
#define PRODL                         4976
#define PRODH                         4977
#define TABLAT                        4978
#define TBLPTRL                       4979
#define TBLPTRH                       4980
#define TBLPTRU                       4981
#define PCL                           4982
#define PCLATH                        4983
#define PCH                           4984
#define PCLATU                        4985
#define PCU                           4986
#define SP0                           4987
#define STKPTR                        4988
#define SP1                           4989
#define SP2                           4990
#define SP3                           4991
#define SP4                           4992
#define STKUNF                        4993
#define STKOVF                        4994
#define STKFUL                        4995
#define TOSL                          4996
#define TOSH                          4997
#define TOSU                          4998

#endif // _PIC18F25K80_H_
